<a href="https://colab.research.google.com/github/unknown-jun/Basic_of_Python/blob/master/26_Nov_2020.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 19. 대입 연산자 이해하기
- 변수에 값을 대입하는데 사용되는 기호는 =입니다
- 수학에서 =은 왼쪽과 오른쪽의 값이 같다는 의미를 가지지만 파이썬을 포함한 컴퓨터 프로그래밍 언어에서 =은 왼쪽 변수에 오른쪽의 값을 대입하겠다는 의미

~~~
예제: a = 7
~~~

* 대입연산자와 일반 연산자를 비교
  1. =: 대입연산자
  2. ==: 같다
  3. in: 여러개의 값을 비교

**문제 53. 주사위 1개를 10번 던지시오!**

In [ ]:
# 예시 1
import random
dice = [1,2,3,4,5,6]
for i in range(1,11): # 아래의 실행문을 10번 수행하겠다.
  result = random.choice(dice) # for loop의 실행문 1
  print(result)  # for loop의 실행문 2

# 예시 2
import random
dice = [1,2,3,4,5,6]
for i in range(1,11): # 아래의 실행문을 10번 수행하겠다.
  result = random.choice(dice) # for loop의 실행문 1
print(result)  # for loop의 실행문이 아니기에 for loop의 영향권의 바깥이다
               # 다시 말해 print 문이 한번만 실행이 된다.

# 파이썬에서 들여쓰기(indention)의 위치는 매우 중요하다!

1
3
4
5
4
5
5
3
6
5
2

**문제 54. 주사위를 10번 던져서 주사위의 눈이 3이 나오는 횟수를 출력하시오**

In [ ]:
import random

dice = [1,2,3,4,5,6]  # 주사위의 값을 설정
cnt = 0   # 횟수를 담기 위한 변수를 cnt라는 이름으로 만들고 숫자 0을 할당함

for i in range(1,11): # 아래의 실행문을 10번 수행하겠다.
  result = random.choice(dice) # 실행문 1
  if result == 3:
    cnt += 1 # indentation을 쓰고 들어가야 if문의 실행문이 됨

print(cnt) # print는 변수 안에 들어잇는 값을 출력하는 함수

1

**문제 55. 주사위를 10번 던져서 주사위의 눈이 짝수가 나오는 횟수를 출력하시오**

In [ ]:
import random

dice = (1,2,3,4,5,6)
cnt = 0

for i in range(1, 11):
  result = random.choice(dice)
  if result in (2,4,6): # 여러개의 값을 비교할 때 in을 사용함
    cnt += 1

print(cnt)

7

**문제 56. 주사위 2개를 동시에 20회 던져 두개의 눈이 합이 10이 되는 횟수를 출력하시오**

In [ ]:
import random 

dice = [1,2,3,4,5,6]
cnt = []

for i in range(1, 21):
  result_1 = random.choice(dice)
  result_2 = random.choice(dice)
  total = result_1 + result_2
  if total == 10:
    cnt.append(total)
  
print('방법 1의 값은', len(cnt))

import random
dice = [1,2,3,4,5,6]
cnt = 0 # 횟수를 담기 위한 cnt라는 변수에 숫자를 0을 넘는다

for i in range(1, 21): # 20번 반복하기 위한 루프문
  result_1 = random.choice(dice) # 실행문 1
  result_2 = random.choice(dice) # 실행문 2
  total = result_1 + result_2
  if total == 10:
    cnt += 1   # if문의 영향권 안에 있는 실행문

print('방법 2의 값은', cnt)

방법 1의 값은 0
방법 2의 값은 1

**문제 57. 주사위 2개를 동시에 던져서 두 눈의 합이 10이 되는 확률을 출력하시오**

In [ ]:
import random
dice = [1,2,3,4,5,6]
cnt = 0 # 횟수를 담기 위한 cnt라는 변수에 숫자를 0을 넘는다
sum = 0

for i in range(1, 21): # 20번 반복하기 위한 루프문
  result_1 = random.choice(dice) # 실행문 1
  result_2 = random.choice(dice) # 실행문 2
  total = result_1 + result_2
  sum += 1
  if total == 10:
    cnt += 1   # if문의 영향권 안에 있는 실행문

print('방법 2의 값은', cnt/sum)

방법 2의 값은 0.2

# 20. 사칙 연산자 이해하기(+, -, /, **)
|오라클| |파이썬|
|:--:|:--:|:--:|
|+| |+|
|-| |-|
|*| |*|
|/| |/|
|mod| |%|
|power| |power(2,3), 2**3|
|sqrt|   |sqrt|
|log2|   |log2|
|log10|  |log10|

예제1. 밑수가 10이고 진수가 10인 log값을 출력하시오

(log 함수를 사용하려면 math 모튤을 import 해야 함)

In [ ]:
import math # 수학에 과련한 함수들이 다 코딩되어 있는 모듈 math를 이 코드에서 사용하겠다.

print(math.log10(10)) 
  # 모듈이름.함수이름(매개변수 값)

1.0

**문제 58. 아래의 수학식을 파이썬으로 구현하시오**

**2 x log<sub>2</sub>10 + 1/3 X log<sub>2</sub>10**

In [ ]:
import math

a = 2 * math.log2(10) + 1/3 * math.log2(10)
print(a)

7.751165554737178

# 21. 연산자 축약 이해하기 (=, -=, *=, /=)
- 변수에 값을 사칙 연산하여 그 결과를 동일한 변수에 대입할 때 연산자를 축약해서 대입할 수 있음

- cnt = cnt + 1을 다음과 같이 쓸 수 있음
    - cnt += 1

```
cnt = cnt + 1     ---->     cnt += 1 과 같음
cnt = cnt - 1     ---->     cnt -= 1 과 같음
cnt = cnt * 2     ---->     cnt *= 2 와 같음
cnt = cnt / 4     ---->     cnt /= 4 와 같음
```

**문제 59. 주사위 10번 던져서 주사위의 눈이 3이 나오는 횟수를 출력하시오(축약 연산자를 이용해서 출력하시오)**

In [ ]:
import random

dice = (1,2,3,4,5,6)
cnt = 0

for i in range(1, 11):
  result = random.choice(dice)
  if result == 3:
    cnt += 1

print(cnt)

2

# 22. True와 False 이해하기
- 참을 나타내는 것이 true이고 거짓을 나타내는 것이 False임
- 그 조건을 판단해서 그 조건이 참이면 True, 거짓이면 False를 리턴함
- True는 1, False = 0 값을 가짐
- True와 False로 표현하면 더 직관적이고 프로그램 코드 가독성을 높일 수 있음

In [ ]:
# 예제
a = True
b = False
print(a)
print(1 == 1) # 결과가 True로 출력됨.
print(1 == 2) # 결과가 False로 출력됨.

# 23. 관계 연산자 이해하기
|오라클| |파이썬|
|--|--|--|
|>| |>|
|>=| |>=|
|<| | <|
|<=| |<=|
|=| |==|
|!=| |!=|
|in||in|

**문제 60. 주사위를 20번 던져서 주사위의 눈이 4 이상 나오는 횟수를 출력하시오**

In [ ]:
import random

dice1 = [1,2,3,4,5,6]
cnt = 0

for i in range(1, 21):
  result = random.choice(dice)
  if result >= 4:
    cnt += 1

print(cnt)

9

**문제 61. (통계 정규분포 문제) 주사위 한개를 288회 던져서 주사위의 눈이 5 이상 나오는 횟수를 구하시오**

In [ ]:
import random

dice = (1,2,3,4,5,6)
cnt = 0

for i in range(1, 289):
  result = random.choice(dice)
  if result >= 5:
    cnt += 1

print(cnt)

89

**문제 62. 주사위 한개를 288회 던질 때, 5 이상의 눈이 나오는 횟수가 90 이상 100이하 나올 확률을 구하시오**

In [ ]:
import random

dice = (1,2,3,4,5,6) # 주사위의 눈금을 지정해줌
cnt = 0   # 주사위의 초기 변수
p_cnt = 0 # 주사위의 눈금이 5가 나올 경우가 90 이상 100이하가 나올 횟수를 초기 변수

for i in range(1, 289):
  result = random.choice(dice)
  if result >= 5:
    cnt += 1
    if cnt >= 90 and cnt <= 100:
      p_cnt += 1

print(p_cnt/288)

0.013888888888888888

**문제 63. 주사위 한개를 288회 던질 때 5 이상의 눈이 나올 횟수를 출력하는데 이 작업을 100번해서 얼마나 횟수가 나왔는지를 100개를 출력하시오**

In [ ]:
import random

dice = (1,2,3,4,5,6)

for j in range(1, 101):
  cnt = 0
  for i in range(1, 289):
    result = random.choice(dice)
    if result >= 5:
      cnt += 1
  print(cnt)

91
98
95
83
84
84
97
99
92
102
107
98
98
78
106
106
102
99
85
100
98
96
87
94
91
96
101
95
98
106
109
100
95
96
85
93
96
91
97
104
73
99
113
109
92
88
106
104
89
99
96
92
99
97
89
95
101
101
101
94
90
107
82
95
101
94
103
103
109
87
95
91
104
96
105
106
106
102
101
96
98
98
100
97
83
99
94
96
88
94
114
102
108
87
75
102
98
94
106
91

**문제 64. 위에서 출력된 횟수 100개를 비어있는 리스트 a에 담고 리스트 a의 갯수를 출력하시오**

In [90]:
import random

dice = (1,2,3,4,5,6) # 리스트형보단 튜플형이 더 빠르기 때문에 튜플을 사용
a = []   #빈 리스트를 지정

for j in range(1, 101): # 주사위를 던질 때 5이상이 나올 횟수를 100번 측정하기 위한 for loop 문
  cnt = 0  # 앞선 for loop문에서 구한 주사위 눈금 5 이상을 초기화 시키는 값
  for i in range(1, 289):        # 주사위 288번을 던지기 위한 for loop 문
    result = random.choice(dice) # 주사위에 대한 랜덤 난수 생성
    if result >= 5: # 눈금 5이상의 값을 추출하기 위한 조건 
      cnt += 1      # 조건이 만족할 경우 1추가
  a.append(cnt)         # for loop문을 빠져나와 리스트 a에 주사위 눈금 5이상의 값을 추가 함

print(len(a))

[102, 82, 91, 91, 101, 96, 99, 94, 108, 103, 98, 108, 109, 101, 82, 94, 102, 86, 105, 94, 113, 121, 88, 98, 104, 99, 112, 105, 88, 76, 97, 107, 93, 79, 100, 102, 99, 92, 88, 90, 97, 83, 90, 97, 96, 87, 101, 102, 89, 103, 91, 113, 107, 85, 98, 110, 103, 105, 104, 109, 94, 95, 93, 89, 94, 104, 106, 119, 94, 97, 100, 102, 98, 91, 85, 108, 109, 104, 90, 104, 109, 99, 98, 114, 101, 99, 98, 102, 89, 85, 93, 99, 84, 86, 100, 80, 97, 107, 103, 91]

**주사위를 굴릴 횟수를 사용자가 정하게 하고서 그 중 5이상이 나올 확률을 구하시오**

In [ ]:
import random

want_cnt = int(input('주사위를 몇번 굴릴까요?: '))
dice = (1,2,3,4,5,6)
cnt = 0

for i in range(1, want_cnt + 1):
  result = random.choice(dice)
  if result >= 5:
    cnt += 1

print(cnt/want_cnt)
print(want_cnt,'중에 5 이상이',cnt,'가 나왔습니다')

주사위를 몇번 굴릴까요?: 1350
0.3340740740740741
1350 중에 5 이상이 451 가 나왔습니다

**문제 65. 동전을 100번 던져서 앞면이 나오는 횟수를 출력하시오!**

In [87]:
import random

coin = ('앞면', '뒷면')
cnt = 0

for i in range(1, 101):
  result = random.choice(coin)
  if result == '앞면':
    cnt += 1

print(cnt)

55

**문제 66. 동전 한개와 주사위 한개를 동시에 100번 던져서 동전이 앞면이 나오고 주사위의 눈이 5가 나오는 횟수를 출력하시오**

In [92]:
import random

coin = ('앞면', '뒷면')
dice = (1,2,3,4,5,6)
cnt = 0

for i in range(1, 101):
  result_1 = random.choice(coin)
  result_2 = random.choice(dice)
  if result_1 == '앞면' and result_2 >= 5:
    cnt += 1

print(cnt)

20

**문제 67. 동전 한개와 주사위 한개를 동시에 100번져서 동전이 앞면이 나오고 주사위의 눈이 5가 나오는 횟수를 출력하는 행위를 50번 해서 횟수가 50개가 출력되게 하시오**

In [98]:
import random

coin = ('앞면', '뒷면')
dice = (1,2,3,4,5,6)

for e in range(1, 51):
  cnt = 0
  for i in range(1, 101):
    result_1 = random.choice(coin)
    result_2 = random.choice(dice)
    if result_1 == '앞면' and result_2 >= 5:
      cnt += 1
  print(cnt)

21
16
12
18
11
16
14
22
16
18
18
14
21
16
12
13
13
26
15
15
15
18
22
20
17
18
17
13
21
17
18
13
14
20
20
11
22
12
18
16
15
21
18
10
16
17
13
20
16
23

**문제 68. 위의 횟수 50개를 비어 있는 리스트 a에 담으시오**

In [100]:
import random

coin = ('앞면', '뒷면')
dice = (1,2,3,4,5,6)
a = []

for e in range(1, 51):
  cnt = 0
  for i in range(1, 101):
    result_1 = random.choice(coin)
    result_2 = random.choice(dice)
    if result_1 == '앞면' and result_2 >= 5:
      cnt += 1
  a.append(cnt)
  
print(a)

[25]
[25, 17]
[25, 17, 18]
[25, 17, 18, 19]
[25, 17, 18, 19, 9]
[25, 17, 18, 19, 9, 13]
[25, 17, 18, 19, 9, 13, 14]
[25, 17, 18, 19, 9, 13, 14, 14]
[25, 17, 18, 19, 9, 13, 14, 14, 13]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17, 20]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17, 20, 13]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17, 20, 13, 14]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17, 20, 13, 14, 14]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17, 20, 13, 14, 14, 18]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17, 20, 13, 14, 14, 18, 14]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17, 20, 13, 14, 14, 18, 14, 18]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17, 20, 13, 14, 14, 18, 14, 18, 15]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17, 20, 13, 14, 14, 18, 14, 18, 15, 16]
[25, 17, 18, 19, 9, 13, 14, 14, 13, 14, 16, 12, 18, 20, 22, 15, 19, 14, 19, 14, 18, 18, 19, 13, 15, 14, 13, 17, 22, 26, 12, 16, 19, 20, 15, 22, 15, 11, 12, 17, 20, 13, 14, 14, 18, 14, 18, 15, 16, 14]

69.

**문제70. 위의 a 리스트 요소들의 평균값을 출력하시오
(numpy를 이용해서 구현하시오)**

In [106]:
import random
import numpy as np

coin = ('앞면', '뒷면')
dice = (1,2,3,4,5,6)
a = []

for e in range(1, 51):
  cnt = 0
  for i in range(1, 101):
    result_1 = random.choice(coin)
    result_2 = random.choice(dice)
    if result_1 == '앞면' and result_2 >= 5:
      cnt += 1
  a.append(cnt)
  
print(np.mean(a))

17.6

**예제. 아래의 리스트의 요소들의 평균값을 출력하시오**

In [105]:
import numpy as np # numpy의 별칭을 np라고 하겠다

b = [7,4,5,3,2]
print(np.mean(b))

4.2

**예제. 아래의 리스트의 요소들의 평균값을 출력하시오
(numpy를 사용하지 않고 구하시오)**

In [128]:
b = [7,4,5,3,2]
print(sum(b)/5)
cnt= 0

for i in b:
  cnt = cnt + i
print(cnt/len(b))

4.2
4.2

**문제 71. 문제 64번 코드를 가져와서 a 리스트의 요소들의 평균과 분산과 표준편차를 출력하시오**

In [131]:
import random
import numpy as np

dice = (1,2,3,4,5,6) # 리스트형보단 튜플형이 더 빠르기 때문에 튜플을 사용
a = []   #빈 리스트를 지정

for j in range(1, 101): # 주사위를 던질 때 5이상이 나올 횟수를 100번 측정하기 위한 for loop 문
  cnt = 0  # 앞선 for loop문에서 구한 주사위 눈금 5 이상을 초기화 시키는 값
  for i in range(1, 289):        # 주사위 288번을 던지기 위한 for loop 문
    result = random.choice(dice) # 주사위에 대한 랜덤 난수 생성
    if result >= 5: # 눈금 5이상의 값을 추출하기 위한 조건 
      cnt += 1      # 조건이 만족할 경우 1추가
  a.append(cnt)         # for loop문을 빠져나와 리스트 a에 주사위 눈금 5이상의 값을 추가 함

print(np.mean(a))
print(np.var(a))
print(np.std(a))

97.33
57.86109999999999
7.606648407807475

**문제 72. 위에 a 리스트에 담긴 요소 100개를 출력하시오**

In [133]:
import random
import numpy as np

dice = (1,2,3,4,5,6) # 리스트형보단 튜플형이 더 빠르기 때문에 튜플을 사용
a = []   #빈 리스트를 지정

for j in range(1, 101): # 주사위를 던질 때 5이상이 나올 횟수를 100번 측정하기 위한 for loop 문
  cnt = 0  # 앞선 for loop문에서 구한 주사위 눈금 5 이상을 초기화 시키는 값
  for i in range(1, 289):        # 주사위 288번을 던지기 위한 for loop 문
    result = random.choice(dice) # 주사위에 대한 랜덤 난수 생성
    if result >= 5: # 눈금 5이상의 값을 추출하기 위한 조건 
      cnt += 1      # 조건이 만족할 경우 1추가
  a.append(cnt)         # for loop문을 빠져나와 리스트 a에 주사위 눈금 5이상의 값을 추가 함
print(a)  # 맨 마지막에  a 리스트를 print하면 아래와 같이 a리스트의 모든 요소들을 한번에 볼수 있음

[97, 109, 86, 86, 105, 108, 89, 101, 97, 90, 89, 94, 97, 92, 108, 89, 108, 108, 99, 99, 106, 97, 97, 104, 91, 105, 95, 95, 104, 90, 92, 88, 85, 99, 103, 101, 85, 104, 111, 86, 99, 94, 104, 101, 108, 100, 110, 99, 83, 96, 92, 94, 85, 98, 80, 103, 101, 108, 89, 106, 96, 83, 102, 90, 90, 111, 88, 95, 96, 97, 85, 101, 95, 88, 92, 87, 91, 91, 89, 108, 78, 102, 104, 106, 94, 89, 110, 101, 95, 91, 97, 88, 88, 113, 94, 104, 101, 99, 82, 90]

**문제 73. 위의 a 리스트의 요소들을 "하나씩" 빼내서 출력하시오**

In [134]:
import random
import numpy as np

dice = (1,2,3,4,5,6) # 리스트형보단 튜플형이 더 빠르기 때문에 튜플을 사용
a = []   #빈 리스트를 지정

for j in range(1, 101): # 주사위를 던질 때 5이상이 나올 횟수를 100번 측정하기 위한 for loop 문
  cnt = 0  # 앞선 for loop문에서 구한 주사위 눈금 5 이상을 초기화 시키는 값
  for i in range(1, 289):        # 주사위 288번을 던지기 위한 for loop 문
    result = random.choice(dice) # 주사위에 대한 랜덤 난수 생성
    if result >= 5: # 눈금 5이상의 값을 추출하기 위한 조건 
      cnt += 1      # 조건이 만족할 경우 1추가
  a.append(cnt)         # for loop문을 빠져나와 리스트 a에 주사위 눈금 5이상의 값을 추가 함

for k in a:
  print(k)

98
94
97
104
95
82
93
106
84
109
99
88
107
83
87
96
102
94
89
97
92
103
90
77
104
106
91
93
100
105
102
96
97
82
86
91
87
94
100
111
90
76
101
104
93
77
98
96
91
103
107
97
92
96
105
93
113
82
89
100
86
103
95
93
98
116
87
99
100
90
107
95
98
92
102
100
111
98
93
98
110
101
97
101
90
103
90
103
99
97
108
110
97
103
106
102
98
93
92
102

**문제74. a 리스트의 요소들의 숫자가 90 이상이고 106이하인 요소들의 갯수를 출력하시오**

In [163]:
import random
import numpy as np

dice = (1,2,3,4,5,6) # 리스트형보단 튜플형이 더 빠르기 때문에 튜플을 사용
a = []   #빈 리스트를 지정

for j in range(1, 101): # 주사위를 던질 때 5이상이 나올 횟수를 100번 측정하기 위한 for loop 문
  cnt = 0  # 앞선 for loop문에서 구한 주사위 눈금 5 이상을 초기화 시키는 값
  for i in range(1, 289):        # 주사위 288번을 던지기 위한 for loop 문
    result = random.choice(dice) # 주사위에 대한 랜덤 난수 생성
    if result >= 5: # 눈금 5이상의 값을 추출하기 위한 조건 
      cnt += 1      # 조건이 만족할 경우 1추가
  a.append(cnt)         # for loop문을 빠져나와 리스트 a에 주사위 눈금 5이상의 값을 추가 함

cnt2=0
for k in a:
  if
   90 <= k <= 106:
    cnt2 += 1
print(cnt2)

73

**문제 75. a 리스트의 요소들의 숫자가 90이상이고 106이하인 요소들의 확률을 구하시오**

In [171]:
import random

dice = (1,2,3,4,5,6) # 리스트형보단 튜플형이 더 빠르기 때문에 튜플을 사용
a = []   #빈 리스트를 지정
sum_d = 0

for j in range(1, 101): # 주사위를 던질 때 5이상이 나올 횟수를 100번 측정하기 위한 for loop 문
  cnt = 0  # 앞선 for loop문에서 구한 주사위 눈금 5 이상을 초기화 시키는 값
  for i in range(1, 289):        # 주사위 288번을 던지기 위한 for loop 문
    result = random.choice(dice) # 주사위에 대한 랜덤 난수 생성
    if result >= 5: # 눈금 5이상의 값을 추출하기 위한 조건 
      cnt += 1      # 조건이 만족할 경우 1추가
  a.append(cnt)         # for loop문을 빠져나와 리스트 a에 주사위 눈금 5이상의 값을 추가 함
  sum_d += 1
  
cnt2=0
for k in a:
  if 90 <= k <= 106:
    cnt2 += 1
print(cnt2/sum_d)

0.7

# 25. 판다스(pandas) 사용법
- pandas란 
    
> 1. 데이터 분석을 위한 파이썬 모듈
2. 엑셀의 스프레드 시트와 같은 관계형 데이터베이스의 데이터 처리 능력이 뛰어남
3. 판다스 Dataframe이라는 기본 자료구조를 사용함(오라클의 테이블과 판다스의 Dataframe이 서로 유사함)

In [177]:
# 예제1. emp3.csv를 파이썬을 이용해서 판다스의 데이터 프레임으로 만드시오

import pandas as pd

from google.colab import files
myfile = files.upload()

Saving emp3.csv to emp3 (1).csv

In [191]:
import pandas as pd


emp = pd.read_csv('emp3.csv') # 판다스의 read_csv는 os의 csv 파일을 읽어서 파이썬 에서 판다스 데이터 프레임으로 만드는 함수
emp

    index  empno   ename        job  ...         hiredate   sal    comm  deptno
0       1   7839    KING  PRESIDENT  ...  1981-11-17 0:00  5000     NaN      10
1       2   7698   BLAKE    MANAGER  ...  1981-05-01 0:00  2850     NaN      30
2       3   7782   CLARK    MANAGER  ...  1981-05-09 0:00  2450     NaN      10
3       4   7566   JONES    MANAGER  ...  1981-04-01 0:00  2975     NaN      20
4       5   7654  MARTIN   SALESMAN  ...  1981-09-10 0:00  1250  1400.0      30
5       6   7499   ALLEN   SALESMAN  ...  1981-02-11 0:00  1600   300.0      30
6       7   7844  TURNER   SALESMAN  ...  1981-08-21 0:00  1500     0.0      30
7       8   7900   JAMES      CLERK  ...  1981-12-11 0:00   950     NaN      30
8       9   7521    WARD   SALESMAN  ...  1981-02-23 0:00  1250   500.0      30
9      10   7902    FORD    ANALYST  ...  1981-12-11 0:00  3000     NaN      20
10     11   7369   SMITH      CLERK  ...  1980-12-09 0:00   800     NaN      20
11     12   7788   SCOTT    ANALYST  ...  1982-12-22 0:00  3000     NaN      20
12     13   7876   ADAMS      CLERK  ...  1983-01-15 0:00  1100     NaN      20
13     14   7934  MILLER      CLERK  ...  1982-01-11 0:00  1300     NaN      10

[14 rows x 9 columns]

~~~
SQL   ---> 데이터에서 정보를 얻어내기 위해서 (데이터 검색)
Pandas --> 데이터를 검색하는 모듈
~~~

**문제 76. (SQL -> Pandas) 사원테이블에서 이름과 월급을 출력하시오**

In [199]:
import pandas as pd

emp = pd.read_csv('emp3.csv') 
emp[['ename', 'sal']] # 데이터 프레임명 [ ['컬럼명1', '컬럼명2']]

     ename   sal
0     KING  5000
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5    ALLEN  1600
6   TURNER  1500
7    JAMES   950
8     WARD  1250
9     FORD  3000
10   SMITH   800
11   SCOTT  3000
12   ADAMS  1100
13  MILLER  1300

**문제 77. 아래의 SQL을 판다스로 구현하시오**
~~~
select ename, sal, jon, hiredate
  from emp;
~~~

In [201]:
print( emp[['ename', 'sal', 'job', 'hiredate']] )

     ename   sal        job         hiredate
0     KING  5000  PRESIDENT  1981-11-17 0:00
1    BLAKE  2850    MANAGER  1981-05-01 0:00
2    CLARK  2450    MANAGER  1981-05-09 0:00
3    JONES  2975    MANAGER  1981-04-01 0:00
4   MARTIN  1250   SALESMAN  1981-09-10 0:00
5    ALLEN  1600   SALESMAN  1981-02-11 0:00
6   TURNER  1500   SALESMAN  1981-08-21 0:00
7    JAMES   950      CLERK  1981-12-11 0:00
8     WARD  1250   SALESMAN  1981-02-23 0:00
9     FORD  3000    ANALYST  1981-12-11 0:00
10   SMITH   800      CLERK  1980-12-09 0:00
11   SCOTT  3000    ANALYST  1982-12-22 0:00
12   ADAMS  1100      CLERK  1983-01-15 0:00
13  MILLER  1300      CLERK  1982-01-11 0:00

**문제 78. 아래의 SQL을 판다스로 구현하시오**
~~~
select ename, sal
  from emp
  where job='SALESMAN';
~~~

In [206]:
emp[['ename', 'sal']] [ emp['job'] == 'SALESMAN']
                              # 검색조건

    ename   sal
4  MARTIN  1250
5   ALLEN  1600
6  TURNER  1500
8    WARD  1250

**문제 79. 월급 3000이상인 사원들의 이름과 월급을 출력하시오**
~~~
select ename, sal
  from emp
  where sal > 3000;
~~~

In [210]:
emp[['ename', 'sal']] [emp['sal'] >= 3000]

    ename   sal
0    KING  5000
9    FORD  3000
11  SCOTT  3000

**문제 80. 아래의 SQL을 pandas로 구현하시오**
~~~
select ename, sal
  from emp
  where sal between 1000 and 3000;
~~~

In [213]:
emp[['ename', 'sal']] [ emp['sal'].between(1000, 3000)]

     ename   sal
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5    ALLEN  1600
6   TURNER  1500
8     WARD  1250
9     FORD  3000
11   SCOTT  3000
12   ADAMS  1100
13  MILLER  1300

**문제 81. 월급이 1000에서 3000 사이가 아닌 사원들의 이름과 월급을 출력하시오**

(not이 판다스에서는 ~ )

~~~
select ename, sal
  from emp
  where sal not between 1000 and 3000;
~~~

In [214]:
emp[['ename', 'sal']] [ ~emp['sal'].between(1000, 3000)]

    ename   sal
0    KING  5000
7   JAMES   950
10  SMITH   800

오라클의 기타 비교 연산자와 파이썬 판다스와의 비교

|오라클| |판다스|
|:---:|---|:---:|
|between ... and| |emp['sal'].between(1000, 3000)|
|in| |emp['job'].isin(['SALESMAN','ANALYST'])|
|is null| |emp['comm'].isnull()|
|like| |apply함수|

**문제 82. 직업이 CLERK, SALESMAN인 사원들의 이름과 직업을 출력하시오**
~~~
select ename, job
  from emp
  where job in ('CLERK', 'SALESMAN')

In [218]:
emp[['ename', 'sal']][emp['job'].isin(['CLERK', 'SALESMAN'])]

     ename   sal
4   MARTIN  1250
5    ALLEN  1600
6   TURNER  1500
7    JAMES   950
8     WARD  1250
10   SMITH   800
12   ADAMS  1100
13  MILLER  1300

**문제 83. 직업이 CLERK, SALESMAN이 아닌 사원들의 이름과 직업을 출력하세요**

In [219]:
emp[['ename','job']] [~emp['job'].isin( ['CLERK', 'SALESMAN'])]

    ename        job
0    KING  PRESIDENT
1   BLAKE    MANAGER
2   CLARK    MANAGER
3   JONES    MANAGER
9    FORD    ANALYST
11  SCOTT    ANALYST

**문제 84. 커미션이 null인 사원들의 이름과 커미션을 출력하시오**
~~~
select ename, comm
  from emp
  where comm is null;
~~~

In [220]:
emp[['ename','comm']] [ emp['comm'].isnull( ['CLERK', 'SALESMAN'])]

     ename  comm
0     KING   NaN
1    BLAKE   NaN
2    CLARK   NaN
3    JONES   NaN
7    JAMES   NaN
9     FORD   NaN
10   SMITH   NaN
11   SCOTT   NaN
12   ADAMS   NaN
13  MILLER   NaN

**문제 85. 커미션이 null이 아닌 사원들의 이름과 커미션을 출력하시오**
~~~
select ename, comm
  from emp
  where comm is not null;
~~~

In [222]:
emp[['ename', 'comm']] [~emp['comm'].isnull()]

    ename    comm
4  MARTIN  1400.0
5   ALLEN   300.0
6  TURNER     0.0
8    WARD   500.0

**문제 86. 통계를 파이썬으로 구현 3번, 6개의 제품이 들어있는 상자가 있는데 그 중에 2개가 불량품이라고 한다. 제품검사를 위해 3개를 추출했을 때 적어도 한개가 불량품일 확률은?**

- 수학식으로 하지 말고 파이썬으로 아래와 같이 상자안에 제품 6개를 넣고 랜덤으로 추출해서 수행하시오
- box=['정상', '정상', '불량', '정상', '불량','정상']
- 사건 A의 여사건(나머지 사건)의 확률은?  ---> P(A<sup>c</sup>) = 1- P(A)
- 불량품이 하나도 없을 사건의 확률을 구한 다음 1에서 빼면 가능
- 비복원 추출로 하시오 (즉, 한번 추출한 제품은 다시 넣지 않는다)

In [232]:
import random

box=['정상', '정상', '불량', '정상', '불량','정상'] # 상자의 상태를 선언
cnt = 0           # 모두 정상이 나올 횟수에 대한 초기값
total_count = 0   # 공을 꺼내는 횟수에 대한 초기값

for i in range(1, 1001):        # 뽑는 것에 대한 loop 상정
  total_count += 1              # 뽑는 것에 대한 횟수
  pick_1 = random.choice(box)   # 박스 1에 대한 랜덤 난수 생성
  pick_2 = random.choice(box)   # 박스 2에 대한 랜덤 난수 생성
  pick_3 = random.choice(box)   # 박스 3에 대한 랜덤 난수 생성
  if pick_1 =='정상' and pick_2 =='정상' and pick_3=='정상':   # 모두 정상품을 뽑을 횟수
    cnt += 1  # 모두 정상을 뽑을 횟수를 카운트

print(1-cnt/total_count) # 여사건을 확률을 계산 (모두가 정상일 확률을 빼면 적어도 하나는 불량품이 나올 확률임)

0.731

In [242]:
import random

box=['정상', '정상', '불량', '정상', '불량','정상'] # 상자의 상태를 선언
cnt = 0           # 모두 정상이 나올 횟수에 대한 초기값
total_count = int(input('얼마나 뽑을까요?: '))

for i in range(1, total_count+1):        # 뽑는 것에 대한 loop 상정
  pick_1 = random.choice(box)   # 박스 1에 대한 랜덤 난수 생성
  pick_2 = random.choice(box)   # 박스 2에 대한 랜덤 난수 생성
  pick_3 = random.choice(box)   # 박스 3에 대한 랜덤 난수 생성
  if pick_1 =='정상' and pick_2 =='정상' and pick_3=='정상':   # 모두 정상품을 뽑을 횟수
    cnt += 1  # 모두 정상을 뽑을 횟수를 카운트

print(1-(cnt/total_count)) # 여사건을 확률을 계산 (모두가 정상일 확률을 빼면 적어도 하나는 불량품이 나올 확률임)

얼마나 뽑을까요?: 1000
0.698